import random

FONTS = [
    {
        "a":"𝐚","b":"𝐛","c":"𝐜","d":"𝐝","e":"𝐞","f":"𝐟","g":"𝐠",
        "h":"𝐡","i":"𝐢","j":"𝐣","k":"𝐤","l":"𝐥","m":"𝐦","n":"𝐧",
        "o":"𝐨","p":"𝐩","q":"𝐪","r":"𝐫","s":"𝐬","t":"𝐭","u":"𝐮",
        "v":"𝐯","w":"𝐰","x":"𝐱","y":"𝐲","z":"𝐳"
    },
    {
        "a":"𝑎","b":"𝑏","c":"𝑐","d":"𝑑","e":"𝑒","f":"𝑓","g":"𝑔",
        "h":"ℎ","i":"𝑖","j":"𝑗","k":"𝑘","l":"𝑙","m":"𝑚","n":"𝑛",
        "o":"𝑜","p":"𝑝","q":"𝑞","r":"𝑟","s":"𝑠","t":"𝑡","u":"𝑢",
        "v":"𝑣","w":"𝑤","x":"𝑥","y":"𝑦","z":"𝑧"
    },
    {
        "a":"𝒂","b":"𝒃","c":"𝒄","d":"𝒅","e":"𝒆","f":"𝒇","g":"𝒈",
        "h":"𝒉","i":"𝒊","j":"𝒋","k":"𝒌","l":"𝒍","m":"𝒎","n":"𝒏",
        "o":"𝒐","p":"𝒑","q":"𝒒","r":"𝒓","s":"𝒔","t":"𝒕","u":"𝒖",
        "v":"𝒗","w":"𝒘","x":"𝒙","y":"𝒚","z":"𝒛"
    },
    {
        "a":"𝕒","b":"𝕓","c":"𝕔","d":"𝕕","e":"𝕖","f":"𝕗","g":"𝕘",
        "h":"𝕙","i":"𝕚","j":"𝕛","k":"𝕜","l":"𝕝","m":"𝕞","n":"𝕟",
        "o":"𝕠","p":"𝕡","q":"𝕢","r":"𝕣","s":"𝕤","t":"𝕥","u":"𝕦",
        "v":"𝕧","w":"𝕨","x":"𝕩","y":"𝕪","z":"𝕫"
    },
    {
        "a":"𝔞","b":"𝔟","c":"𝔠","d":"𝔡","e":"𝔢","f":"𝔣","g":"𝔤",
        "h":"𝔥","i":"𝔦","j":"𝔧","k":"𝔨","l":"𝔩","m":"𝔪","n":"𝔫",
        "o":"𝔬","p":"𝔭","q":"𝔮","r":"𝔯","s":"𝔰","t":"𝔱","u":"𝔲",
        "v":"𝔳","w":"𝔴","x":"𝔵","y":"𝔶","z":"𝔷"
    }
]


def stylish_text(text):
    font = random.choice(FONTS)

    return "".join(
        font.get(char.lower(), char)
        for char in text
    )
